src/Documents/ВводОстатков/ВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатков</name>
  <registerRecords>InformationRegister.РС_Остатки_ДС_ПоВидуНакопления</registerRecords>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводОстатковДС</name>
    <attributes>
      <name>МестоХраненияДС</name>
      <type>
        <types>CatalogRef.ИсточникХраненияДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ИсточникХраненияДС/ИсточникХраненияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникХраненияДС</name>
  <owners>Catalog.Семья</owners>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДС</name>
    <type>
      <types>EnumRef.Вид_ДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банк</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ВводОстатков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьИсточникиХраненияДС ();
	Объект.ОбщаяСумма = Объект.ВводОстатковДС.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникиХраненияДС()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсточникХраненияДС.Ссылка КАК МестоХраненияДС
	|ИЗ
	|	Справочник.ИсточникХраненияДС КАК ИсточникХраненияДС
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ИсточникХраненияДС.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИсточникХраненияДС.СрокДействия > &ТекДаты
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ИсточникХраненияДС.Активна = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТекДаты", ТекущаяДата());
	
	РЗ = Запрос.Выполнить();
	ТЗ = РЗ.Выгрузить();
	
	Объект.ВводОстатковДС.Загрузить(ТЗ);
КонецПроцедуры
